"""
Модуль с константами.
"""

LANG_PACK = {
    "title": "Конспектер",
    "subtitle": "Персональный помощник для студентов",
    "description": "Введите текст или загрузите файл формата `.txt` - и нажмите на кнопку **Запуск** для получение конспекта.",
    "text_area_label": "Ваш текст. ",
    "file_uploader_label": "Или загрузите файл",
    "btn_start_label": "Запуск",
    "result_text": "Результат:",
    "empty_input_text": "Tip: не хватает данных, загрузите пожалуйста файл или введите текств поле :)",
    "loading_model_text": "Загружаем модельку, пожалуйста подождите...",
    "loading_result_text": "Обрабатываем ваш запрос, пожалуйста подождите...",
    "summaraizer_tab": "Конспектер👋",
    "translator_tab": "Переводчик👈",
    "nothing_tab": "Что-то еще",
    "title_question": "Конспектер",
    "subtitle_question": "Персональный помощник для студентов",
    "number_of_questions": "Количество вопросов:",
    "single_questions": "Количество вопросов: 1",
    "max_len_question": "Максимальная длина вопроса:",
}

STATE_KEY_FILE_UPLOADER = "file_uploader"
STATE_KEY_TEXT_AREA = "text_area"
